---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder.#ctor(System.Guid)
source: html/e2dd3c2d-f72c-a393-a802-2b7d3a595482.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder.#ctor Method

Constructs a new SchemaBuilder where the resulting Schema will use the input GUID.

## Syntax (C#)
```csharp
public SchemaBuilder(
	Guid guid
)
```

## Parameters
- **guid** (`System.Guid`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - The guid value is invalid.